Repository: quarkusio/es.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: es_es

source: In the example above the `artifact` used in the condition configuration happens to be a runtime Quarkus extension artifact but it could as well be any other artifact. There could also be more than one `artifact` element in the body of `dependencyCondition`.
es_es: En el ejemplo anterior, el `artifact` utilizado en la configuración de la condición resulta ser un artefacto de extensión de Quarkus en tiempo de ejecución, pero también podría ser cualquier otro artefacto. También podría haber más de un elemento `artifact` en el cuerpo de `dependencyCondition`.

source: In the generated build file, you can see 2 test dependencies:
es_es: En el archivo de construcción generado, puede ver 2 dependencias de prueba:

source: In the spirit of the times, the Quarkus Team virtually presents a big, loud, and bold, rock & roll mega-stadium tour.
es_es: Con el espíritu de los tiempos que corren, el equipo Quarkus presenta virtualmente una mega-gira de rock & roll grande, ruidosa y atrevida.

source: In this case, `io.quarkus.container.image.openshift.deployment.OpenshiftBuild` should be included in one of the extension deployment dependencies and implement `java.util.function.BooleanSupplier`. At build time, the Quarkus bootstrap will create an instance of it and register `io.quarkus.container.image.openshift` capability only if its `getAsBoolean()` method returns true.
es_es: En este caso, `io.quarkus.container.image.openshift.deployment.OpenshiftBuild` debe incluirse en una de las dependencias de despliegue de la extensión e implementar `java.util.function.BooleanSupplier`. En el momento de la construcción, el bootstrap de Quarkus creará una instancia de la misma y registrará la capacidad de `io.quarkus.container.image.openshift` sólo si su método `getAsBoolean()` devuelve true.

source: In this case, the Maven dependency is not at all required in the `pom.xml`.
es_es: En este caso, la dependencia de Maven no es necesaria en absoluto en la página web `pom.xml`.

source: In this guide you will learn how to deploy a Quarkus based web application as a web-dyno to Heroku.
es_es: En esta guía aprenderás a desplegar una aplicación web basada en Quarkus como web-dyno en Heroku.

source: In this guide, we will explore:
es_es: En esta guía, exploraremos:

source: In this session the Quarkus Team will give you a unique, hands-on experience: An introduction to Quarkus, a follow-along hands-on demo or two and then a Q&A with some of the band, umm, developers involved.
es_es: En esta sesión, el equipo de Quarkus te ofrecerá una experiencia práctica única: Una introducción a Quarkus, una o dos demostraciones prácticas y, a continuación, una sesión de preguntas y respuestas con algunos de los desarrolladores implicados.

source: In which cases could conditional dependencies be useful? A typical example would be a component that should be activated **only** in case all of its required dependencies are available. If one or more of the component's required dependencies aren't available, instead of failing, the component should simply not be activated.
es_es: ¿En qué casos podrían ser útiles las dependencias condicionales? Un ejemplo típico sería un componente que debe activarse **sólo** en caso de que todas sus dependencias requeridas estén disponibles. Si una o más de las dependencias necesarias del componente no están disponibles, en lugar de fallar, el componente simplemente no debería activarse.

source: In your `Dockerfile`, just use:
es_es: En su `Dockerfile`, sólo tiene que utilizar:

source: In-Person and online events which feature Quarkus tracks, discussion and topics.
es_es: Eventos en persona y en línea que presentan desarrollos, debates y temas de Quarkus.

source: Inbound Metadata
es_es: Metadatos de entrada

source: Including any one of those extensions in an application will enable the RESTEasy JSON serializer. In case a build step needs to check whether the RESTEasy JSON serializer is already enabled in an application, instead of checking whether any of those capabilities is present, it could simply check whether an extension with prefix `io.quarkus.resteasy.json` is present.
es_es: La inclusión de cualquiera de estas extensiones en una aplicación habilitará el serializador JSON de RESTEasy. En caso de que un paso de compilación necesite comprobar si el serializador JSON de RESTEasy ya está habilitado en una aplicación, en lugar de comprobar si está presente alguna de esas capacidades, podría simplemente comprobar si está presente una extensión con el prefijo `io.quarkus.resteasy.json`.

source: Including extra files
es_es: Inclusión de archivos adicionales

source: Incoming channel configuration
es_es: Configuración del canal de entrada

source: Indicates that the content is sent using `Server Sent Events`
es_es: Indica que el contenido se envía utilizando `Server Sent Events`

source: Indicates that the method consumes the items from the `requests` channel
es_es: Indica que el método consume los elementos del canal `requests`

source: Indicates that the objects returned by the method are sent to the `quotes` channel
es_es: Indica que los objetos devueltos por el método se envían al canal `quotes`

source: Indicates that the processing is _blocking_ and cannot be run on the caller thread.
es_es: Indica que el procesamiento está _bloqueando_ y no puede ser ejecutado en el hilo de la llamada.

source: Inject a Reactive Messaging `Emitter` to send messages to the `quote-requests` channel.
es_es: Inyectar una Mensajería Reactiva `Emitter` para enviar mensajes al canal `quote-requests`.

source: Inject the LiquibaseFactory object
es_es: Inyectar el objeto LiquibaseFactory

source: Injecting beans
es_es: Inyección de beans

source: Injection Discovery/Navigation
es_es: Descubrimiento/navegación de la inyección

source: Injects the `quotes` channel using the `@Channel` qualifier
es_es: Inyecta el canal `quotes` utilizando el calificador `@Channel`

source: Inspecting the list of consumer groups and their consumption lag
es_es: Inspección de la lista de grupos de consumidores y su retraso en el consumo

source: Install the Azure CLI
es_es: Instalar la CLI de Azure

source: Install the Heroku CLI
es_es: Instalar la CLI de Heroku

source: Install via Command Line Interface
es_es: Instalación a través de la interfaz de línea de comandos

source: Instructs the prices channel to be managed by the AMQP connector
es_es: Indica que el canal de precios debe ser gestionado por el conector AMQP

source: Intro
es_es: Introducción

source: Introduction
es_es: Introducción

source: Issues
es_es: Problemas

source: It does not make sense to use multiple extension as part of the same build. When multiple container image extensions are present, an error will be raised to inform the user. The user can either remove the unneeded extensions or select one using `application.properties`.
es_es: No tiene sentido utilizar varias extensiones como parte de la misma construcción. Cuando haya varias extensiones de imagen de contenedor, se producirá un error para informar al usuario. El usuario puede eliminar las extensiones innecesarias o seleccionar una utilizando `application.properties`.

source: It generates the following in `./getting-started`:
es_es: Genera lo siguiente en `./getting-started`:

source: It includes a bunch of bugfixes, together with documentation improvements.
es_es: Incluye una serie de correcciones de errores, junto con mejoras en la documentación.

source: It is possible to deploy images hosted on Docker Hub, but this location by default leaves images accessible to anyone. To better protect your container images, this guide shows how to host your images on a private instance of the Azure Container Registry service.
es_es: Es posible desplegar imágenes alojadas en Docker Hub, pero esta ubicación por defecto deja las imágenes accesibles a cualquiera. Para proteger mejor sus imágenes de contenedores, esta guía muestra cómo alojar sus imágenes en una instancia privada del servicio Azure Container Registry.

source: It is possible to specify `onlyIfNot` conditions as well. . Conditions can also be set for required capabilities.
es_es: También es posible especificar las condiciones de `onlyIfNot`. . También se pueden establecer condiciones para las capacidades requeridas.

source: It is possible to specify `onlyIfNot` conditions as well. Conditions can also be set for required capabilities.
es_es: También es posible especificar las condiciones de `onlyIfNot`. También se pueden establecer condiciones para las capacidades requeridas.

source: It produces several outputs in `/target`:
es_es: Produce varias salidas en `/target`:

source: It's a very simple REST endpoint, returning "Hello from RESTEasy Reactive" to requests on "/hello".
es_es: Se trata de un endpoint REST muy sencillo, que devuelve "Hello from RESTEasy Reactive" a las peticiones en "/hello".

source: It’s a snap to be up and running with Quarkus.
es_es: Es muy fácil ponerse en marcha con Quarkus.

source: It’s going to be a blast. 90 odd minutes of technical discussion, some live coding and a Q&A.
es_es: Va a ser una explosión. 90 minutos de debate técnico, codificación en directo y preguntas y respuestas.

source: JSON is now the lingua franca between microservices. See how you can get your REST services to consume and produce JSON payloads.
es_es: JSON es ahora la lengua franca entre los microservicios. Vea cómo puede hacer que sus servicios REST consuman y produzcan cargas útiles JSON.

source: JVM Debugging
es_es: Depuración de la JVM

source: Jan 01, 2016
es_es: 01 de enero de 2016

source: Jan 01, 2021
es_es: 01 de enero de 2021

source: Java is used by https://www.daxx.com/blog/development-trends/number-software-developers-world[millions^] of developers worldwide and according to Redmonk, https://redmonk.com/sogrady/2021/08/05/language-rankings-6-21/[recently moved^] back to the #2 most used programming language. There are many distributions of the Java runtime and development kit, but the Eclipse Temurin (formerly known as AdoptOpenJDK) distribution has proven to be the https://snyk.io/jvm-ecosystem-report-2021/[most popular^]. Recently, the AdoptOpenJDK project was moved into the Eclipse Foundation as https://adoptium.net/[Eclipse Adoptium^]. The goal of Adoptium is to promote and support high-quality, TCK certified runtimes and associated technology for use across the Java ecosystem. It does this by performing regular builds, tests, certifications, and of course serving binaries to those millions of developers that need to evaluate, prototype, and run production workloads with Java. Like other open source Eclipse projects, the team behind the distribution API are mostly volunteers, so they are constantly looking for optimizations of their time and resources and technology used to deliver on their mission.
es_es: Java es utilizado por https://www.daxx.com/blog/development-trends/number-software-developers-world[millones^] de desarrolladores en todo el mundo y, según Redmonk, https://redmonk.com/sogrady/2021/08/05/language-rankings-6-21/[recientemente^] ha pasado a ser el segundo lenguaje de programación más utilizado. Hay muchas distribuciones del kit de desarrollo y tiempo de ejecución de Java, pero la distribución Eclipse Temurin (antes conocida como AdoptOpenJDK) ha demostrado ser la https://snyk.io/jvm-ecosystem-report-2021/[más popular^]. Recientemente, el proyecto AdoptOpenJDK se trasladó a la Fundación Eclipse como https://adoptium.net/[Eclipse Adoptium^]. El objetivo de Adoptium es promover y apoyar tiempos de ejecución de alta calidad con certificación TCK y la tecnología asociada para su uso en todo el ecosistema Java. Para ello, realiza compilaciones periódicas, pruebas, certificaciones y, por supuesto, suministra binarios a los millones de desarrolladores que necesitan evaluar, crear prototipos y ejecutar cargas de trabajo de producción con Java. Al igual que otros proyectos de código abierto de Eclipse, el equipo que está detrás de la API de distribución es mayoritariamente voluntario, por lo que busca constantemente optimizar su tiempo y recursos y la tecnología utilizada para cumplir su misión.

source: Java is used by millions of developers worldwide and is the second most popular language, and they all need a Java runtime. Adoptium, the most popular Java distribution, needed to offer a way for developers to programmatically discover and access pre-built Java binaries across many different variants, and produced an end-user API with Quarkus to improve performance and developer productivity.
es_es: Java es utilizado por millones de desarrolladores en todo el mundo y es el segundo lenguaje más popular, y todos ellos necesitan un tiempo de ejecución de Java. Adoptium, la distribución de Java más popular, necesitaba ofrecer una forma de que los desarrolladores descubrieran y accedieran mediante programación a los binarios de Java preconstruidos en muchas variantes diferentes, y produjo una API de usuario final con Quarkus para mejorar el rendimiento y la productividad de los desarrolladores.

source: Jib Options
es_es: Opciones de pluma

source: Join the Quarkus Community
es_es: Únase a la Comunidad Quarkus

source: Join us as we explore how Quarkus helps Java developers everywhere to be more productive, create modern masterpieces and, have a little bit more fun.
es_es: Únase a nosotros para descubrir cómo Quarkus ayuda a los desarrolladores Java de todo el mundo a ser más productivos, crear obras maestras modernas y divertirse un poco más.

source: Kafka Dev UI is part of the Quarkus Dev UI and is only available in development mode.
es_es: Kafka Dev UI forma parte de Quarkus Dev UI y sólo está disponible en modo de desarrollo.

source: Kafka Streams with Quarkus
es_es: Kafka Streams con Quarkus

source: Keep in mind that this service does not provide scalability. A container instance is unique and does not scale.
es_es: Tenga en cuenta que este servicio no proporciona escalabilidad. Una instancia de contenedor es única y no es escalable.

source: Kubernetes Config
es_es: Configuración de Kubernetes

source: Kubernetes Permissions
es_es: Permisos de Kubernetes

source: Kubernetes configuration example
es_es: Ejemplo de configuración de Kubernetes

source: Kubernetes, but also bare metal
es_es: Kubernetes, pero también bare metal

source: Kubernetes-native Spring Apps on Quarkus
es_es: Aplicaciones Spring nativas de Kubernetes en Quarkus

source: LICENSE
es_es: LICENCIA

source: Last Publish Date
es_es: Última fecha de publicación

source: Lead Developer on the Adoptium Technical Steering Committee
es_es: Desarrollador principal del Comité Directivo Técnico de Adoptium

source: Learn Quarkus basics by standing up a straightforward application serving a hello endpoint.
es_es: Aprenda los fundamentos de Quarkus poniendo en marcha una aplicación sencilla que sirva a un endpoint de hola.

source: Learn how to create a reactive application with Quarkus and explore the different features offered by Quarkus.
es_es: Aprenda a crear una aplicación reactiva con Quarkus y explore las diferentes características que ofrece Quarkus.

source: Learn how to create, package, and deploy a Hello World Quarkus application including a JAX-RS endpoint and functional tests.
es_es: Aprenda a crear, empaquetar y desplegar una aplicación Hello World Quarkus, incluyendo un punto final JAX-RS y pruebas funcionales.

source: Learn how to use continuous testing in your Quarkus Application.
es_es: Aprenda a utilizar las pruebas continuas en su aplicación Quarkus.

source: Learn more about developing reactive applications with Quarkus.
es_es: Aprenda más sobre el desarrollo de aplicaciones reactivas con Quarkus.

source: Let's assume that our Quarkus application needs to talk to PostgreSQL and that when PostgreSQL was deployed on our Kubernetes cluster, a `Secret` named `postgresql` was created as part of that deployment and contains the following entries:
es_es: Supongamos que nuestra aplicación Quarkus necesita hablar con PostgreSQL y que cuando PostgreSQL se desplegó en nuestro clúster Kubernetes, se creó un `Secret` llamado `postgresql` como parte de ese despliegue y contiene las siguientes entradas:

source: Let's create an application in your account and deploy that repository to it:
es_es: Vamos a crear una aplicación en tu cuenta y a desplegar ese repositorio en ella:

source: Let's take the following scenario as an example: `quarkus-extension-a` has an optional dependency on `quarkus-extension-b` which should be included in a Quarkus application only if `quarkus-extension-c` is found among its dependencies (direct or transitive). In other words, the presence of `quarkus-extension-c` is the condition which, if satisfied, enables `quarkus-extension-b` during the build of a Quarkus application.
es_es: Tomemos el siguiente escenario como ejemplo: `quarkus-extension-a` tiene una dependencia opcional de `quarkus-extension-b` que debe incluirse en una aplicación Quarkus sólo si `quarkus-extension-c` se encuentra entre sus dependencias (directas o transitivas). En otras palabras, la presencia de `quarkus-extension-c` es la condición que, si se cumple, habilita a `quarkus-extension-b` durante la construcción de una aplicación Quarkus.

source: Let’s go to the quark of things.
es_es: Vayamos al quark de las cosas.

source: Let’s start with the basics: HTTP microservices. In this context, you need to develop an HTTP endpoint, often called REST or CRUD. You process incoming HTTP requests, and to do so you often need to rely on other services, such as databases, or another HTTP service.
es_es: Empecemos por lo básico: los microservicios HTTP. En este contexto, necesitas desarrollar un endpoint HTTP, a menudo llamado REST o CRUD. Procesas las peticiones HTTP entrantes, y para ello normalmente necesitas apoyarte en otros servicios, como bases de datos, o en otro servicio HTTP.

source: Let’s take a very simple application handling <em>elements</em> from the periodic table. The code would be something like:
es_es: Tomemos una aplicación muy sencilla que maneje <em>elementos</em> de la tabla periódica. El código sería algo así:

source: License
es_es: Licencia

source: Like a capability name, a capability prefix is a dot-separated string that is composed of either the first capability name element or a dot-separated sequence of the capability name elements starting from the first one. E.g. for capability `io.quarkus.resteasy.json.jackson` the following prefixes will be registered:
es_es: Al igual que un nombre de capacidad, un prefijo de capacidad es una cadena separada por puntos que se compone del primer elemento de nombre de capacidad o de una secuencia separada por puntos de los elementos de nombre de capacidad empezando por el primero. Por ejemplo, para la capacidad `io.quarkus.resteasy.json.jackson` se registrarán los siguientes prefijos:

source: List of applied or not applied liquibase ChangeSets
es_es: Lista de los ChangeSets de liquibase aplicados o no aplicados

source: Listing and creating topics
es_es: Listado y creación de temas

source: Live Coding
es_es: Codificación en vivo

source: Live Coding with Quarkus
es_es: Codificación en vivo con Quarkus

source: Live Coding with Quarkus also proved extremely useful when developing the application:
es_es: El Live Coding con Quarkus también resultó muy útil a la hora de desarrollar la aplicación:

source: Live reload
es_es: Recarga en vivo

source: Login to Azure
es_es: Iniciar sesión en Azure

source: Login to Google Cloud
es_es: Iniciar sesión en Google Cloud

source: Maintainer
es_es: Mantenedor

source: Make sure use the documentation to have your questions answered.
es_es: Asegúrese de utilizar la documentación para obtener respuesta a sus preguntas.

source: Make sure you change the image URL to point to the image you built and pushed earlier!
es_es: Asegúrate de cambiar la URL de la imagen para que apunte a la imagen que construiste y subiste antes!

source: Make sure you have the getting-started application at hand, or clone the Git repository: `git clone {quickstarts-clone-url}`, or download an {quickstarts-archive-url}[archive]. The solution is located in the `getting-started` directory.
es_es: Asegúrate de tener a mano la aplicación de inicio, o clona el repositorio Git: `git clone {quickstarts-clone-url}` o descargue un {quickstarts-archive-url}[archivo]. La solución se encuentra en el directorio `getting-started`.

source: Make sure you reference the image you uploaded previously (assumes that a role exists that can be used to run the lambda). Please note that it is not unlikely that for the JVM lambda function, the default memory limit of `128Mb` will not be enough to run the function. In that case, you can increase the memory limit when creating the function by providing the `--memory-size 256` parameter to your `aws lambda create-function` command. You can also adjust the function in the AWS console after you've created it.
es_es: Asegúrate de que haces referencia a la imagen que has subido previamente (se supone que existe un rol que puede ser utilizado para ejecutar la lambda). Ten en cuenta que no es improbable que para la función lambda de JVM, el límite de memoria por defecto de `128Mb` no sea suficiente para ejecutar la función. En ese caso, puede aumentar el límite de memoria al crear la función proporcionando el parámetro `--memory-size 256` a su comando `aws lambda create-function`. También puede ajustar la función en la consola de AWS después de haberla creado.

source: Mandatory
es_es: Obligatorio

source: Maven goals reference
es_es: Referencia de los objetivos de Maven

source: May 2, 2019
es_es: 2 de mayo de 2019

source: Messages coming from AMQP contain an instance of `IncomingAmqpMetadata` in the metadata.
es_es: Los mensajes procedentes de AMQP contienen una instancia de `IncomingAmqpMetadata` en los metadatos.

source: Microservices tend to come in systems. Let’s now imagine you need to access another HTTP endpoint. You can use an HTTP client directly; this is nothing more than repeating boilerplate code. Quarkus provides a way to call HTTP endpoints easily using the <a href="https://quarkus.io/guides/rest-client">MicroProfile Rest Client API</a>.
es_es: Los microservicios suelen venir en sistemas. Imaginemos ahora que necesitas acceder a otro endpoint HTTP. Puedes usar un cliente HTTP directamente; esto no es más que repetir código boilerplate. Quarkus proporciona una manera de llamar a los endpoints HTTP fácilmente utilizando la <a href="https://quarkus.io/guides/rest-client">API del cliente REST de MicroProfile</a>.

source: Mixing security tests
es_es: Mezcla de pruebas de seguridad

source: Mock mailer
es_es: Simulacro de envío de correo

source: More Information
es_es: Más información

source: More Spring guides
es_es: Más guías de Spring

source: More details about the AMQP Address model can be found in the https://activemq.apache.org/components/artemis/documentation/2.0.0/address-model.html[Artemis documentation].
es_es: Puede encontrar más detalles sobre el modelo de direcciones AMQP en la https://activemq.apache.org/components/artemis/documentation/2.0.0/address-model.html[documentación de Artemis].

source: More information about the health extension can be found in xref:microprofile-health.adoc[the Microprofile Health guide].
es_es: Encontrará más información sobre la extensión de salud en xref:microprofile-health.adoc[la guía Salud del Microperfil].
